//=======================================Copyright(c)==========================================
// 								  深圳易马达科技有限公司
//---------------------------------------文件信息----------------------------------------------
//文件名   	: main.c
//创建人  	: Handry
//创建日期	:
//描述	    : 主函数
//-----------------------------------------------当前版本修订----------------------------------
//修改人   	: Hollis
//版本	    :
//修改日期	:
//描述	    : ,BMS_ENABLE_NB_IOT
//=============================================================================================

//=============================================================================================
//头文件定义
//=============================================================================================
#include "main.h"
#include "BSPCriticalZoom.h"
#include "BSPHardWareIntf.h"
#include "BSPUserHOOK.h"
#include "BSPTask.h"
#include "ShutDownMode.h"
  
int main(void) 
{   
	BeforeEnableIntHook();				    //中断前调用初始化函数
    
	BSPEnterCritical();         			//关中断，进入屏蔽区，初始化
	
	BeforeInitAllHook();        			//系统初始化前工作
	BSPSysInit();               			//系统初始化
	AfterInitAllHook();         			//系统初始化后工作

	BSPExitCritical();          			//开中断，跳出屏蔽区，执行任务
	
	AfterEnableIntHook();					//中断后调用初始化函数

    while (1)
    {	
        BSPTaskProcess();                   //任务进程
        ShutDownModeTask();                 //关机模式 
    }
}

/************************ (C) COPYRIGHT IMMOTOR *****END OF FILE****/

