/****************************************************************************/
/* 	File    	BSP_TIM.h 			 
 * 	Author		Hollis
 *	Notes
 * 
 *	Version		Date    		Change Logs:
 *  V1.0.0 		2021-06-08		first version         	
 * 
 * Copyright (c) 2021, Immotor
*****************************************************************************/
#ifndef __BSP_TIM_H__
#define __BSP_TIM_H__

#include <stdint.h>
#include "main.h"


  /* Initialize TIMx peripheral as follows:
       + Period = 10000 - 1
       + Prescaler = (SystemCoreClock/10000) - 1
       + ClockDivision = 0
       + Counter direction = Up
  */

#define PRESCALER_VALUE (uint32_t)(((SystemCoreClock) / (1000000)) - 1) 	//分频系数
#define PERIOD_VALUE 	(1000 - 1);									//计数值

/*****************************************************
	* 函数功能: LPTIM基础配置
	* 输入参数: void
	* 返 回 值: uint8_t 0 为发送成功	非0表示发送失败
	* 说    明：该定时器用于休眠定时唤醒喂狗
******************************************************/
uint8_t MX_LPTIM1_Init(void);  
void    MX_LPTIM1_DeInit(void);
//uint8_t MX_LPTIM2_Init(void);

/*****************************************************
	* 函数功能: 定时器初始化
	* 输入参数: void
	* 返 回 值: uint8_t 0 为发送成功	非0表示发送失败
	* 说    明：无
******************************************************/
void BSPPITInit(void);

/*****************************************************
	* 函数功能: 定时器停止
	* 输入参数: void
	* 返 回 值: uint8_t 0 为发送成功	非0表示发送失败
	* 说    明：无
******************************************************/
void BSPTimerStop(void);

/*****************************************************
	* 函数功能: us延迟
	* 输入参数: us
	* 返 回 值: 无
	* 说    明：死等型
******************************************************/
void delay_xus(uint16_t us);

/*****************************************************
	* 函数功能: 获取低功耗定时器喂狗标志
	* 输入参数: 无
	* 返 回 值: 无 
	* 说    明：
******************************************************/
uint8_t Get_TIM_FeedDogFlag(void);

/*****************************************************
	* 函数功能: 清除低功耗定时器喂狗标志
	* 输入参数: 无
	* 返 回 值: 无
	* 说    明：
******************************************************/
void BSP_TIM_ClearFeedDogFlag(void);

#endif /* __BSP_TIM_H__ */
