//=======================================Copyright(c)===========================================
// 								  深圳易马达科技有限公司
//---------------------------------------文件信息----------------------------------------------
//文件名   	: ParaCfg.c
//创建人  	: Handry
//创建日期	: 
//描述	    : 参数配置源文件
//-----------------------------------------------当前版本修订----------------------------------
//修改人   	:
//版本	    :
//修改日期	:
//描述	    :
//=============================================================================================
//=============================================================================================
//包含头文件
//=============================================================================================
#include "ParaCfg.h"
#include "DTTimer.h"
#include "BatteryInfo.h"

//=============================================================================================
//定义全局变量
//=============================================================================================
t_CONFIG_PARA gConfig;
t_CONFIG_PARA gConfigBuff;//保存配置的输入buffer

t_DT_PARA gConfigChgCurr; //充电过流实际使用的配置值

#if defined(LFP_AK_15000MAH_16S) || defined(LFP_TB_20000MAH_20S) || defined(LFP_HL_25000MAH_16S)
//时间数字为秒，S
const t_CONFIG_PARA cConfigInit =	//初始化值通过校准等命令写入Flash，flash异常则赋值给gConfig
{
    PARA_CFG_FLAG,						//配置标志
    {0xffff,0xffff,0xffff,0xffff},		//SN码

	{//单体电池过压
		{3400,3450,3500,3700},	//1 2 3 4 级成熟值
		{3300,3350,3400,3500},	//1 2 3 4 级恢复值
		{4 ,1 ,2 ,4 },			//1 2 3 4 级成熟时间
		{4 ,1 ,2 ,2 },			//1 2 3 4 级恢复时间
	},
	{//单体电池欠压
		#if defined(LFP_HL_25000MAH_16S)
		{3000,2900,2800,2600},	//1 2 3 4 级成熟值
		{3100,3000,3000,2800},	//1 2 3 4 级恢复值
		#elif defined(LFP_TB_20000MAH_20S)
		{3000,2900,2800,2600},	//1 2 3 4 级成熟值
		{3100,3000,3000,2800},	//1 2 3 4 级恢复值
        #else
		{3000,2900,2800,2600},	//1 2 3 4 级成熟值
		{3100,3000,3000,2800},	//1 2 3 4 级恢复值        
		#endif
		{1 ,2 ,2 ,4 },			//1 2 3 4 级成熟时间
		{1 ,2 ,2 ,2 },			//1 2 3 4 级恢复时间
	},
	{//总电压过压
		{2500,2500,2500,2000},	//1 2 3 4 级成熟值
		{2501,2501,2501,2300},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,1 },			//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,1 },			//1 2 3 4 级恢复时间
	},
	{//总电压欠压
		{2500,2500,2500,2000},	//1 2 3 4 级成熟值
		{2501,2501,2501,2300},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,1 },			//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,1 },			//1 2 3 4 级恢复时间
	},
	{//单体充电过温
//        {320,320,450,550},	//1 2 3 4 级成熟值
//		  {280,280,430,500},	//1 2 3 4 级恢复值
        {320,320,450,600},	//1 2 3 4 级成熟值
		{280,280,430,550},	//1 2 3 4 级恢复值
		{3 ,3 ,2 ,3 },		//1 2 3 4 级成熟时间
		{3 ,3 ,2 ,5 },		//1 2 3 4 级恢复时间
	},
	{//单体充电欠温
		{0,0,30,0},			//1 2 3 4 级成熟值
		{50,50,50,50},		//1 2 3 4 级恢复值
		{3 ,3 ,2 ,3 },		//1 2 3 4 级成熟时间
		{3 ,3 ,2 ,5 },		//1 2 3 4 级恢复时间
	},
	{//单体放电过温
		{320,320,550,650},	//1 2 3 4 级成熟值
		{280,280,540,600},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,5 },		//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,5 },		//1 2 3 4 级恢复时间
	},
	{//单体放电欠温
    #if defined(LFP_HL_25000MAH_16S)
		{0,0,-150,-150},	//1 2 3 4 级成熟值
		{50,50,-140,-100},	//1 2 3 4 级恢复值
    #else
		{0,0,-150,-250},	//1 2 3 4 级成熟值
		{50,50,-140,-200},	//1 2 3 4 级恢复值
    #endif        
		{4 ,3 ,2 ,5 },		//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,5 },		//1 2 3 4 级恢复时间
	},
	{//平均温度过温
		{320,320,320,340},	//1 2 3 4 级成熟值
		{280,280,280,300},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,1 },		//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,1 },		//1 2 3 4 级恢复时间
	},
	{//平均温度欠温
		{320,320,320,340},	//1 2 3 4 级成熟值
		{280,280,280,300},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,1 },		//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,1 },		//1 2 3 4 级恢复时间
	},
	{//充电过流
        {160,200,450,675},  //1 2 3 4 级成熟值,此处用作与SOP计算出的值作偏移
        {120,121,122,123},  //1 2 3 4 级恢复值偏移值
        {1 ,18 ,13 ,9 },    //1 2 3 4 级成熟时间
        {1 ,9  ,10 ,11},    //1 2 3 4 级恢复时间
	},
	{//放电过流
		#if defined(LFP_HL_25000MAH_16S)
		{-3000,-4000,-10000,-20000},	//1 2 3 4 级成熟值
		#elif defined(LFP_TB_20000MAH_20S)
		{-3000,-4000,-10000,-20000},	//1 2 3 4 级成熟值
		#else
		{-3000,-4000,-6000,-8000},	//1 2 3 4 级成熟值
		#endif
		{-2900,-10,-10,-10},		//1 2 3 4 级恢复值
		{4 ,4 ,0xffff,0xffff},		//1 2 3 4 级成熟时间
		{1 ,20 ,20 ,20 },			//1 2 3 4 级恢复时间
	},
	{//SOC过高
		{10,330,330,330},	//1 2 3 4 级成熟值
		{5,280,280,300},	//1 2 3 4 级恢复值
		{2 ,3 , 2  , 1 },	//1 2 3 4 级成熟时间
		{0, 10 ,10 ,10 },	//1 2 3 4 级恢复时间
	},
	{//SOC过低
		{330,330,330,20},	//1 2 3 4 级成熟值
		{400,400,400,60},	//1 2 3 4 级恢复值
		{2 ,3 ,2 ,2 },		//1 2 3 4 级成熟时间
		{0 ,10 ,10 ,1 },	//1 2 3 4 级恢复时间
	},
	{//PCB板温度过高
		{0,0,0,800},	//1 2 3 4 级成熟值
		{0,0,0,700},	//1 2 3 4 级恢复值
		{2 ,3 ,1 ,1 },	//1 2 3 4 级成熟时间
		{0 ,10 ,1 ,1 },	//1 2 3 4 级恢复时间
	},
	{//连接器温度过高
		{0,0,0,800},	//1 2 3 4 级成熟值
		{0,0,0,700},	//1 2 3 4 级恢复值
		{2 ,3 ,2 ,1 },	//1 2 3 4 级成熟时间
		{0 ,10 ,10 ,1 },//1 2 3 4 级恢复时间
	},
	{//预放管温度过高
		{0,0,0,800},	//1 2 3 4 级成熟值
		{0,0,0,700},	//1 2 3 4 级恢复值
		{0 ,0 ,0 ,1 },	//1 2 3 4 级成熟时间
		{0 ,10 ,10 ,1 },//1 2 3 4 级恢复时间
	},

	{//TVS管温度过高
		{0,0,0,800},	//1 2 3 4 级成熟值
		{0,0,0,700},	//1 2 3 4 级恢复值
		{2 ,3 ,1 ,1 },	//1 2 3 4 级成熟时间
		{0 ,0 ,1 ,1 },	//1 2 3 4 级恢复时间
	},

    {//电压差异过大
//        {50,100,200,300},	//1 2 3 4 级成熟值
//        {45,95,195,295},	//1 2 3 4 级恢复值
        {300,300,350,400},	//1 2 3 4 级成熟值
        {295,295,345,395},	//1 2 3 4 级恢复值        
        {4 ,4 ,4 ,4 },		//1 2 3 4 级成熟时间
        {4 ,4 ,4 ,4 },		//1 2 3 4 级恢复时间
    },

    {//温度差异过大
//        {60,90,150,300/*2900*/},	//1 2 3 4 级成熟值
//        {40,100,160,280},			//1 2 3 4 级恢复值
//        {4 ,4 ,4 ,4 },				//1 2 3 4 级成熟时间
//        {4 ,4 ,4 ,4 },				//1 2 3 4 级恢复时间
        {60,90,150,300/*2900*/},	//1 2 3 4 级成熟值
        {40,80,140,280},			//1 2 3 4 级恢复值
        {4 ,4 ,4 ,4 },				//1 2 3 4 级成熟时间
        {4 ,4 ,4 ,4 },				//1 2 3 4 级恢复时间        
    },

	/* 故障字1 */
	//AFE故障
	{2,1},				//成熟时间	恢复时间
	//电量计故障
	{2,1},				//成熟时间	恢复时间
	//RTC故障
	{2,1},				//成熟时间	恢复时间
	//FLASH故障
	{2,1},				//成熟时间	恢复时间
	//放电MOS失效
	{2,1},				//成熟时间	恢复时间
	//充电MOS失效
	{2,1},				//成熟时间	恢复时间
	//预启动电路故障
	{2,1},				//成熟时间	恢复时间
	//rtc未校准
	{2,1},				//成熟时间	恢复时间
	//参数未校准
	{2,1},				//成熟时间	恢复时间
	//保险丝失效
	{2,1},				//成熟时间	恢复时间
	//加速度计故障
	{2,1},				//成熟时间	恢复时间
	//其他设备故障
	{2,1},				//成熟时间	恢复时间

	/* 故障字2 */
	//充电MOS NTC失效
	{2,1},				//成熟时间	恢复时间
	//放电MOS NTC失效
	{2,1},				//成熟时间	恢复时间
	//电量计NTC 失效
	{2,1},				//成熟时间	恢复时间
	//连接器NTC 失效
	{2,1},				//成熟时间	恢复时间
	//TVS NTC失效
	{2,1},				//成熟时间	恢复时间
	//电池 NTC1失效
	{2,1},				//成熟时间	恢复时间
	//电池 NTC2失效
	{2,1},				//成熟时间	恢复时间
	//外置模块 短路失效
	{2,1},				//成熟时间	恢复时间
    
	/* 故障字3 */
	//预启动失败超时
	{1,1},				//成熟时间	恢复时间
	//预启动失败外部重载/短路
	{1,1},				//成熟时间	恢复时间

	/* 故障字4 */
	//放电过流保护锁定
	{1,1},				//成熟时间	恢复时间
	//充电过流保护锁定
	{1,1},				//成熟时间	恢复时间
	//AFE ALERT故障
	{1,1},				//成熟时间	恢复时间
	//AFE XREADY故障
	{1,1},				//成熟时间	恢复时间
	//睡眠模式过流故障
	{1,1},				//成熟时间	恢复时间

    {
        1,      //均衡使能
        3700,   //均衡电压上限值   	
        3400,   //均衡电压下限值
        40,     //均衡压差阈值
    },      
    {
        1020,	//afe current sample resistor，单位1uR
        0,      //afe current sample offset
		2000,	//bat16 ADC gain，单位0.01uV/bit
        0,		//bat16 offset，单位1mV
        100,	//默认值100，电量计分流电阻阻值
        2,      //电量计至少剩余更新的次数，小于此数不更新电量计了
        20,     //电量计零飘
        0x3EE,  //电量计k值斜率
    },  
 //加速度配置    
#ifdef     PARA_ENABLE_ACC  
    {
        0,		//是否使能Tap中断
        3,   //2,   //ACTIVE中断滤波时间
        255,//150,	//ACTIVE中断加速度阈值
        200,//224	//自由落体持续时间
        60,//95,110,	//自由落体失重阈值  mod by handry 20/10/20 降低检测灵敏度 
                        //自由落体失重阈值  mod by handry 20/12/1  降低检测灵敏度 
    },
#endif     
    0,	//CRC 16
    
	/* 额外配置参数 */
    {
	 	/*
		Handry Add 20-07-02
		3C电流检测 配置参数:
		*/   
		//.currdet.highcurrdet = 0x3300 | (((uint16_t)(((float)BAT_NORM_CAP)*0.0015 )) & 0x00FF), /*转换为2A单位*/   	
		.currdet.highcurrdet = 0x2212, /*转换为2A单位*/	
        
        {//B11使用，预启动电阻温度过高 21.01.26
            {650,700,750,800},	//1 2 3 4 级成熟值
            {550,600,650,700},			//1 2 3 4 级恢复值
            {4 ,4 ,2 ,4 },				//1 2 3 4 级成熟时间
            {4 ,4 ,2 ,4 },				//1 2 3 4 级恢复时间        
        },
    },		
};

#else

//时间数字为秒，S
const t_CONFIG_PARA cConfigInit =	//初始化值通过校准等命令写入Flash，flash异常则赋值给gConfig
{
    PARA_CFG_FLAG,						//配置标志
    {0xffff,0xffff,0xffff,0xffff},		//SN码

	{//单体电池过压
		{3000,3150,4190,4200},	//1 2 3 4 级成熟值
		{2900,3100,4150,4100},	//1 2 3 4 级恢复值
		{4 ,1 ,2 ,4 },			//1 2 3 4 级成熟时间
		{4 ,1 ,2 ,2 },			//1 2 3 4 级恢复时间
	},
	{//单体电池欠压
		{3500,3450,3200,3100},	//1 2 3 4 级成熟值
		{3550,3500,3500,3300},	//1 2 3 4 级恢复值
		{1 ,2 ,2 ,4 },			//1 2 3 4 级成熟时间
		{1 ,2 ,2 ,2 },			//1 2 3 4 级恢复时间
	},
	{//总电压过压
		{2500,2500,2500,2000},	//1 2 3 4 级成熟值
		{2501,2501,2501,2300},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,1 },			//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,1 },			//1 2 3 4 级恢复时间
	},
	{//总电压欠压
		{2500,2500,2500,2000},	//1 2 3 4 级成熟值
		{2501,2501,2501,2300},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,1 },			//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,1 },			//1 2 3 4 级恢复时间
	},
    #if defined(SY_PB_32000MAH_14S) || defined(SY_PB_32000MAH_16S) || defined(SY_PB_32000MAH_17S)
	{//单体充电过温
		{320,320,400,560},	//1 2 3 4 级成熟值
		{280,280,380,510},	//1 2 3 4 级恢复值
		{3 ,3 ,2 ,3 },		//1 2 3 4 级成熟时间
		{3 ,3 ,2 ,5 },		//1 2 3 4 级恢复时间
	},    
    #else
	{//单体充电过温
		{320,320,400,500},	//1 2 3 4 级成熟值
		{280,280,380,450},	//1 2 3 4 级恢复值
		{3 ,3 ,2 ,3 },		//1 2 3 4 级成熟时间
		{3 ,3 ,2 ,5 },		//1 2 3 4 级恢复时间
	},
    #endif
	{//单体充电欠温
		{0,0,30,0},			//1 2 3 4 级成熟值
		{50,50,50,50},		//1 2 3 4 级恢复值
		{3 ,3 ,2 ,3 },		//1 2 3 4 级成熟时间
		{3 ,3 ,2 ,5 },		//1 2 3 4 级恢复时间
	},
	{//单体放电过温
        #if defined(SY_PB_32000MAH_14S) || defined(SY_PB_32000MAH_16S) || defined(SY_PB_32000MAH_17S)
		{320,320,500,550},	//1 2 3 4 级成熟值
		{280,280,490,500},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,5 },		//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,5 },		//1 2 3 4 级恢复时间        
        #else
		{320,320,550,650},	//1 2 3 4 级成熟值
		{280,280,540,600},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,5 },		//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,5 },		//1 2 3 4 级恢复时间
        #endif
	},
	{//单体放电欠温
		{0,0,-150,-250},	//1 2 3 4 级成熟值
		{50,50,-140,-200},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,5 },		//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,5 },		//1 2 3 4 级恢复时间
	},
	{//平均温度过温
		{320,320,320,340},	//1 2 3 4 级成熟值
		{280,280,280,300},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,1 },		//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,1 },		//1 2 3 4 级恢复时间
	},
	{//平均温度欠温
		{320,320,320,340},	//1 2 3 4 级成熟值
		{280,280,280,300},	//1 2 3 4 级恢复值
		{4 ,3 ,2 ,1 },		//1 2 3 4 级成熟时间
		{4 ,3 ,2 ,1 },		//1 2 3 4 级恢复时间
	},
	{//充电过流
        {160,200,450,675},  //1 2 3 4 级成熟值,此处用作与SOP计算出的值作偏移
        {120,121,122,123},  //1 2 3 4 级恢复值偏移值
        {1 ,18 ,13 ,9 },    //1 2 3 4 级成熟时间
        {1 ,9  ,10 ,11},    //1 2 3 4 级恢复时间
	},
	{//放电过流
		{-3000,-4000,-10000,-20000},	//1 2 3 4 级成熟值
		{-2900,-10,-10,-10},		//1 2 3 4 级恢复值
		{4 ,4 ,0xffff,0xffff},		//1 2 3 4 级成熟时间
		{1 ,20 ,20 ,20 },			//1 2 3 4 级恢复时间
	},
	{//SOC过高
		{10,330,330,330},	//1 2 3 4 级成熟值
		{5,280,280,300},	//1 2 3 4 级恢复值
		{2 ,3 , 2  , 1 },	//1 2 3 4 级成熟时间
		{0, 10 ,10 ,10 },	//1 2 3 4 级恢复时间
	},
	{//SOC过低
		{330,330,330,20},	//1 2 3 4 级成熟值
		{400,400,400,60},	//1 2 3 4 级恢复值
		{2 ,3 ,2 ,2 },		//1 2 3 4 级成熟时间
		{0 ,10 ,10 ,1},	//1 2 3 4 级恢复时间
	},
	{//PCB板温度过高
		{0,0,0,800},	//1 2 3 4 级成熟值
		{0,0,0,700},	//1 2 3 4 级恢复值
		{2 ,3 ,1 ,1 },	//1 2 3 4 级成熟时间
		{0 ,10 ,1 ,1 },	//1 2 3 4 级恢复时间
	},
	{//连接器温度过高
		{0,0,0,800},	//1 2 3 4 级成熟值
		{0,0,0,700},	//1 2 3 4 级恢复值
		{2 ,3 ,2 ,1 },	//1 2 3 4 级成熟时间
		{0 ,10 ,10 ,1 },//1 2 3 4 级恢复时间
	},
	{//预放管温度过高
		{0,0,0,800},	//1 2 3 4 级成熟值
		{0,0,0,700},	//1 2 3 4 级恢复值
		{0 ,0 ,0 ,1 },	//1 2 3 4 级成熟时间
		{0 ,10 ,10 ,1 },//1 2 3 4 级恢复时间
	},

	{//TVS管温度过高
		{0,0,0,800},	//1 2 3 4 级成熟值
		{0,0,0,700},	//1 2 3 4 级恢复值
		{2 ,3 ,1 ,1 },	//1 2 3 4 级成熟时间
		{0 ,0 ,1 ,1 },	//1 2 3 4 级恢复时间
	},

    {//电压差异过大
        {50,100,200,300},	//1 2 3 4 级成熟值
        {45,95,195,295},	//1 2 3 4 级恢复值
        {4 ,4 ,4 ,4 },		//1 2 3 4 级成熟时间
        {4 ,4 ,4 ,4 },		//1 2 3 4 级恢复时间
    },

    {//温度差异过大
//        {60,90,150,300/*2900*/},	//1 2 3 4 级成熟值
//        {40,100,160,280},			//1 2 3 4 级恢复值
//        {4 ,4 ,4 ,4 },				//1 2 3 4 级成熟时间
//        {4 ,4 ,4 ,4 },				//1 2 3 4 级恢复时间
        {60,90,150,300/*2900*/},	//1 2 3 4 级成熟值
        {40,80,140,280},			//1 2 3 4 级恢复值
        {4 ,4 ,4 ,4 },				//1 2 3 4 级成熟时间
        {4 ,4 ,4 ,4 },				//1 2 3 4 级恢复时间        
    },

	/* 故障字1 */
	//AFE故障
	{2,1},				//成熟时间	恢复时间
	//电量计故障
	{2,1},				//成熟时间	恢复时间
	//RTC故障
	{2,1},				//成熟时间	恢复时间
	//FLASH故障
	{2,1},				//成熟时间	恢复时间
	//放电MOS失效
	{2,1},				//成熟时间	恢复时间
	//充电MOS失效
	{2,1},				//成熟时间	恢复时间
	//预启动电路故障
	{2,1},				//成熟时间	恢复时间
	//rtc未校准
	{2,1},				//成熟时间	恢复时间
	//参数未校准
	{2,1},				//成熟时间	恢复时间
	//保险丝失效
	{2,1},				//成熟时间	恢复时间
	//加速度计故障
	{2,1},				//成熟时间	恢复时间
	//其他设备故障
	{2,1},				//成熟时间	恢复时间

	/* 故障字2 */
	//充电MOS NTC失效
	{2,1},				//成熟时间	恢复时间
	//放电MOS NTC失效
	{2,1},				//成熟时间	恢复时间
	//电量计NTC 失效
	{2,1},				//成熟时间	恢复时间
	//连接器NTC 失效
	{2,1},				//成熟时间	恢复时间
	//TVS NTC失效
	{2,1},				//成熟时间	恢复时间
	//电池 NTC1失效
	{2,1},				//成熟时间	恢复时间
	//电池 NTC2失效
	{2,1},				//成熟时间	恢复时间
	//外置模块 短路失效
	{2,1},				//成熟时间	恢复时间
    
	/* 故障字3 */
	//预启动失败超时
	{1,1},				//成熟时间	恢复时间
	//预启动失败外部重载/短路
	{1,1},				//成熟时间	恢复时间

	/* 故障字4 */
	//放电过流保护锁定
	{1,1},				//成熟时间	恢复时间
	//充电过流保护锁定
	{1,1},				//成熟时间	恢复时间
	//AFE ALERT故障
	{1,1},				//成熟时间	恢复时间
	//AFE XREADY故障
	{1,1},				//成熟时间	恢复时间
	//睡眠模式过流故障
	{1,1},				//成熟时间	恢复时间
    
    {
        1,      //均衡使能
        4500,   //均衡电压上限值   	
        3500,   //均衡电压下限值
        20,     //均衡压差阈值
    },
    {
        1020,	//afe current sample resistor，单位1uR
        0,      //afe current sample offset
		2000,	//bat16 ADC gain，单位0.01uV/bit
        0,		//bat16 offset，单位1mV
        100,	//默认值100，电量计分流电阻阻值
        2,      //电量计至少剩余更新的次数，小于此数不更新电量计了
        20,     //电量计零飘
        0x3EE,  //电量计k值斜率
    },  
 //加速度配置    
#ifdef     PARA_ENABLE_ACC  
    {
        0,		//是否使能Tap中断
        3,   //2,   //ACTIVE中断滤波时间
        255,//150,	//ACTIVE中断加速度阈值
        200,//224	//自由落体持续时间
        60,//95,110,	//自由落体失重阈值  mod by handry 20/10/20 降低检测灵敏度 
                        //自由落体失重阈值  mod by handry 20/12/1  降低检测灵敏度 
    },
#endif     
    0,	//CRC 16
    
	/* 额外配置参数 */
    {
	 	/*
		Handry Add 20-07-02
		3C电流检测 配置参数:
		*/   
		//.currdet.highcurrdet = 0x3300 | (((uint16_t)(((float)BAT_NORM_CAP)*0.0015 )) & 0x00FF), /*转换为2A单位*/   	
		.currdet.highcurrdet = 0x2212, /*转换为2A单位*/	
        
        {//B11使用，预启动电阻温度过高 21.01.26
            {650,700,750,800},	//1 2 3 4 级成熟值
            {550,600,650,700},			//1 2 3 4 级恢复值
            {4 ,4 ,2 ,4 },				//1 2 3 4 级成熟时间
            {4 ,4 ,2 ,4 },				//1 2 3 4 级恢复时间        
        },
    },		
};

#endif


//=============================================================================================
//定义接口函数
//=============================================================================================
//=============================================================================================
//函数名称	: void ParaInit(void)
//函数参数	:
//输出参数	:
//静态变量	:
//功	能	: 参数初始化函数
//注	意	:
//=============================================================================================
void ParaInit(void)
{
	gConfig = cConfigInit;
}

/*****************************************end of ParaCfg.c*****************************************/
