//=======================================Copyright(c)===========================================
// 								  深圳易马达科技有限公司
//---------------------------------------文件信息----------------------------------------------
//文件名   	: Sign.h
//创建人  	: 
//创建日期	:
//描述	    : sim模组打卡登记头文件
//-----------------------------------------------当前版本修订----------------------------------
//修改人   	:
//版本	    :
//修改日期	:
//描述	    : 
//=============================================================================================
#ifndef __SIGH_H_
#define __SIGH_H_

#ifdef __cplusplus
extern "C"{
#endif
    
//=============================================================================================
//包含头文件
//=============================================================================================
#include "BSPTypeDef.h"

//=============================================================================================
//宏参数设定
//=============================================================================================
#define LOGIN_MAX_TIME 		    (g_Settings.loginMaxMinute * 60)
#define g_RemainSeconds 	    g_Settings.remainSeconds
#define SIGN_DEFAULT_MINUTE     180

//=============================================================================================
//声明接口函数
//=============================================================================================

//打卡信息打印
void Sign_Dump(const char* pTag);

//获取打卡剩余分钟
uint32 Sign_GetRemainMin(void);

//获取打卡时间点
uint32 Sign_GetSignTime(void);

//不使能打卡时间复位
void Sign_DisableTimerReset(Bool isTrue);

//设置剩余时间
void Sign_SetMaxTime(uint32 minute);

//打卡功能使能/去使能
void Sign_SetEnable(Bool isEnable);

//是否使能打卡
Bool IsSignEn(void);

//打卡时间开始计时
void Sign_TimerStart(void);

//打卡时间停止计时，计算间隔时间
void Sign_TimerStop(void);

//打卡时间复位
void Sign_TimerReset(void);

//确认打卡的时间点是否正常
Bool Sign_IsOk(void);

#ifdef __cplusplus
}
#endif

#endif

/*****************************************end of Sign.h*****************************************/
