/****************************************************************************/
/* 	File    	BSP_CAN.h 			 
 * 	Author		Hollis
 *	Notes
 * 
 *	Version		Date    		Change Logs:
 *  V1.0.0 		2021-06-08	first version         	
 * 
 * Copyright (c) 2021, Immotor
*****************************************************************************/
#ifndef __BSP_CAN_H__
#define __BSP_CAN_H__

#include <stdint.h>


#define DEST_ADDRESS_CAN1 0x1111UL  //该端口暂无使用

#define DEST_ADDRESS_CAN2 0x1130UL	//发送的目标地址

#define SOUR_ADDRESS 	  0x3011UL	//电池的源地址

/*****************************************************
	* 函数功能: CAN1经典配置
    * 输入参数: void
	* 返 回 值: void
	* 说    明：
******************************************************/
void MX_FDCAN1_Init(void);

/*****************************************************
	* 函数功能: CAN2经典配置
    * 输入参数: void
	* 返 回 值: void
	* 说    明：
******************************************************/
void MX_FDCAN2_Init(void);

/*****************************************************
	* 函数功能: CAN设备  关断
	* 输入参数: void
	* 返 回 值: void
	* 说    明：
******************************************************/
void MX_FDCAN2_DeInit(void);

/*****************************************************
	* 函数功能: CAN1数据发送
    * 输入参数: 帧ID exfid	| 数据地址pbuff	|数据长度len
	* 返 回 值: uint8_t 0 为发送成功	非0表示发送失败
	* 说    明：发送超时需配置
******************************************************/
uint8_t FDCAN1_SendMsg(unsigned char * pbuff , unsigned short len );

/*****************************************************
	* 函数功能: CAN2数据发送
    * 输入参数: 帧ID exfid	| 数据地址pbuff	|数据长度len
	* 返 回 值: uint8_t 0 为发送成功	非0表示发送失败
	* 说    明：发送超时需配置
******************************************************/
uint8_t FDCAN2_SendMsg(unsigned char * pbuff , unsigned short len );

#endif /* __BSP_CAN_H__ */

