/****************************************************************************/
/* 	File    	BSP_IWDG.h 			 
 * 	Author		Hollis
 *	Notes
 * 
 *	Version		Date    		Change Logs:
 *  V1.0.0 		2021-06-08	first version         	
 * 
 * Copyright (c) 2021, Immotor
*****************************************************************************/
#ifndef __BSP_IWDG_H__
#define __BSP_IWDG_H__

#include <stdint.h>
#include "main.h"

/*****************************************************
	* 函数功能: 看门狗初始化
	* 输入参数: rlv Min_Data = 0 and Max_Data = 0x0FFF
	* 返 回 值: void
	* 说    明：开启后无法关断开门狗，可以冻结
******************************************************/
void MX_IWDG_Init(uint32_t rlv);

/*****************************************************
	* 函数功能: 喂狗函数
	* 输入参数: void
	* 返 回 值: void
	* 说    明：
******************************************************/
void  FeedIDog(void);

#endif /* __BSP_IWDG_H__ */
