/****************************************************************************/
/* 	File    	BSP_EXIT.h 			 
 * 	Author		Hollis
 *	Notes
 * 
 *	Version		Date    		Change Logs:
 *  V1.0.0 		2021-06-08	    first version         	
 * 
 * Copyright (c) 2021, Immotor
*****************************************************************************/
#ifndef __BSP_EXIT_H__
#define __BSP_EXIT_H__

#include <stdint.h>
#include "main.h"
#define MODULE_INT_IRQ		EXTI4_15_IRQn
#define	MODULE_INT_PORT 	GPIOA			//内部无线模块中断	下降沿触发
#define	MODULE_INT_PIN 		GPIO_PIN_11		//外部模块接入产生低电平信号，未接入为高电平

/********************************************************************
	* 函数功能: IO中断初始化
	* 输入参数: 无
	* 返 回 值: 无
	* 说    明：中断对应的函数入口位于 HAL_GPIO_EXTI_Falling_Callback
********************************************************************/
void BSPExitInit(void);

/********************************************************************
	* 函数功能: 设置 外置设备接入 状态
	* 输入参数: 无
	* 返 回 值: 无
	* 说    明：
********************************************************************/
void SET_MODU_STA(uint8_t flag);

/********************************************************************
	* 函数功能: 获取 外置设备接入 状态
	* 输入参数: 无
	* 返 回 值: 无
	* 说    明：
********************************************************************/
uint8_t GET_MODU_INT_STA(void);

#endif /* __BSP_EXIT_H__ */

